app/views/forums/index.html.erb

      <td><h4><%= link_to h(forum.title), forum_path(forum.id) %></h4>
        <small><%= forum.topics.count %> topics</small>
---
SELECT "topics".* FROM "topics" WHERE (forum_id = 1) ORDER BY last_post_at DESC LIMIT 1
SELECT COUNT(*) FROM "topics" WHERE "topics"."forum_id" = 1