app/views/topics/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br />
    <%= f.collection_select :user_id, User.all, :id, :name %>

SELECT "forums".* FROM "forums"
---
	<%= f.label :forum_id %><br />
	 <%= f.collection_select :forum_id, Forum.all, :id, :title %>