app/views/topics/_posts.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = 1
---
  <tbody>
    <% @topic.posts.each do |post| %>

SELECT "users".* FROM "users"
---
        <%= form_for([@topic, Post.new]) do |f| %>
          <%= f.collection_select :user_id, User.all, :id, :name %>