app/views/topics/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = 1
---

	<% @topic.posts.each do|p|%>