app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", "index"]]
---
def show
  @forum = Forum.find(params[:id])

INSERT INTO "forums" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Oct 2011 20:43:17 UTC +00:00], ["title", "First Forum"], ["updated_at", Tue, 18 Oct 2011 20:43:17 UTC +00:00]]
---
  def create
    @forum = Forum.new(params[:forum])
    if @forum.save