app/controllers/posts_controller.rb

  def set_topic
    @topic = Topic.find(params[:topic_id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]