app/controllers/topics_controller.rb

INSERT INTO "topics" ("created_at", "forum_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 19 Oct 2011 01:08:21 UTC +00:00], ["forum_id", nil], ["title", "Topic 1"], ["updated_at", Wed, 19 Oct 2011 01:08:21 UTC +00:00], ["user_id", 0]]
---
  def create
    @topic = Topic.new(params[:topic])
    if @topic.save

SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @topic = Topic.find(params[:id])